User363293/STM32H7_FreeRTOS/Core/Inc/FreeRTOSIPConfig.h
/* If ipconfigFILTER_OUT_NON_ETHERNET_II_FRAMES is set to 1 then Ethernet frames
that are not in Ethernet II format will be dropped.  This option is included for
potential future IP stack developments. */
#define ipconfigFILTER_OUT_NON_ETHERNET_II_FRAMES  1 //---------------------------------------------------------------

/* If ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES is set to 1 then it is the
responsibility of the Ethernet interface to filter out packets that are of no
interest.  If the Ethernet interface does not implement this functionality, then
set ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES to 0 to have the IP stack
perform the filtering instead (it is much less efficient for the stack to do it
because the packet will already have been passed into the stack).  If the
Ethernet driver does all the necessary filtering in hardware then software
filtering can be removed by using a value other than 1 or 0. */
#define ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES	1 //---------------------------------------------------------------

/* The windows simulator cannot really simulate MAC interrupts, and needs to
block occasionally to allow other tasks to run. */
//#define configWINDOWS_MAC_INTERRUPT_SIMULATOR_DELAY ( 2 / portTICK_PERIOD_MS )

/* Advanced only: in order to access 32-bit fields in the IP packets with
32-bit memory instructions, all packets will be stored 32-bit-aligned, plus
16-bits.  This has to do with the contents of the IP-packets: all 32-bit fields
are 32-bit-aligned, plus 16-bit(!). */
#define ipconfigPACKET_FILLER_SIZE 2 //---------------------------------------------------------------

/* Define the size of the pool of TCP window descriptors.  On the average, each
TCP socket will use up to 2 x 6 descriptors, meaning that it can have 2 x 6
outstanding packets (for Rx and Tx).  When using up to 10 TP sockets
simultaneously, one could define TCP_WIN_SEG_COUNT as 120. */
#define ipconfigTCP_WIN_SEG_COUNT 64 //---------------------------------------------------------------

/* Each TCP socket has a circular buffers for Rx and Tx, which have a fixed
maximum size.  Define the size of Rx buffer for TCP sockets. */
#define ipconfigTCP_RX_BUFFER_LENGTH			( 8 * ipconfigTCP_MSS ) //---------------------------------------------------------------

/* Define the size of Tx buffer for TCP sockets. */
#define ipconfigTCP_TX_BUFFER_LENGTH			( 8 * ipconfigTCP_MSS ) //---------------------------------------------------------------

/* When using call-back handlers, the driver may check if the handler points to
real program memory (RAM or flash) or just has a random non-zero value. */
#define ipconfigIS_VALID_PROG_ADDRESS(x) ( (x) != NULL ) //---------------------------------------------------------------

/* Include support for TCP hang protection.  All sockets in a connecting or
disconnecting stage will timeout after a period of non-activity. */
#define ipconfigTCP_HANG_PROTECTION				( 1 ) //---------------------------------------------------------------
#define ipconfigTCP_HANG_PROTECTION_TIME		( 30 ) //---------------------------------------------------------------

/* Include support for TCP keep-alive messages. */
#define ipconfigTCP_KEEP_ALIVE				( 1 ) //---------------------------------------------------------------
#define ipconfigTCP_KEEP_ALIVE_INTERVAL		( 20 ) /* in seconds */ //---------------------------------------------------------------

#define ipconfigUSE_DHCP_HOOK				( 1 ) //---------------------------------------------------------------

/* UDP Logging related constants follow.  The standard UDP logging facility
writes formatted strings to a buffer, and creates a task that removes messages
from the buffer and sends them to the UDP address and port defined by the
constants that follow. */

/* Prototype for the function used to print out.  In this case the standard
UDP logging facility is used. */
//extern int lUDPLoggingPrintf( const char *pcFormatString, ... );

/* Set to 1 to print out debug messages.  If ipconfigHAS_DEBUG_PRINTF is set to
1 then FreeRTOS_debug_printf should be defined to the function used to print
out the debugging messages. */
#ifndef ipconfigHAS_DEBUG_PRINTF
	#define ipconfigHAS_DEBUG_PRINTF	0 //---------------------------------------------------------------
#endif

#if( ipconfigHAS_DEBUG_PRINTF == 1 )
	#define FreeRTOS_debug_printf(X)	lUDPLoggingPrintf X
#endif

/* Set to 1 to print out non debugging messages, for example the output of the
FreeRTOS_netstat() command, and ping replies.  If ipconfigHAS_PRINTF is set to 1
then FreeRTOS_printf should be set to the function used to print out the
messages. */
#ifndef ipconfigHAS_PRINTF
	#define ipconfigHAS_PRINTF			0 //---------------------------------------------------------------
#endif

#if( ipconfigHAS_PRINTF == 1 )
	#define FreeRTOS_printf(X)			lUDPLoggingPrintf X
#endif

//#define ipconfigFTP_ZERO_COPY_ALIGNED_WRITES	0
#define ipconfigDNS_USE_CALLBACKS				0 //---------------------------------------------------------------
#define ipconfigSUPPORT_SIGNALS					0 //---------------------------------------------------------------

#define ipconfigMAC_INTERRUPT_PRIORITY	( configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY )


#define ipconfigUSE_CALLBACKS					1 //---------------------------------------------------------------

#define ipconfigCHECK_IP_QUEUE_SPACE			0 //---------------------------------------------------------------

//#define USE_IPERF                               1

//#define ipconfigIPERF_DOES_ECHO_UDP		        0

//#define ipconfigIPERF_VERSION					3
//#define ipconfigIPERF_STACK_SIZE_IPERF_TASK		680

//#if 1
//#define ipconfigIPERF_TX_BUFSIZE				( 24 * ipconfigTCP_MSS )
//#define ipconfigIPERF_TX_WINSIZE				( 12 )
//#define ipconfigIPERF_RX_BUFSIZE				( 24 * ipconfigTCP_MSS )
//#define ipconfigIPERF_RX_WINSIZE				( 12 )

/* The iperf module declares a character buffer to store its send data. */
//#define ipconfigIPERF_RECV_BUFFER_SIZE			( 24 * ipconfigTCP_MSS )
//#endif

#define ipconfigETHERNET_MINIMUM_PACKET_BYTES	( 60 ) //---------------------------------------------------------------

//#define ipconfigENDPOINT_DNS_ADDRESS_COUNT		( 2 )

